MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK26FN2M0VLQ18/mcu.h
/****************************************************************************
**
** Copyright (C) 2025 MikroElektronika d.o.o.
** Contact: https://www.mikroe.com/contact
**
** This file is part of the mikroSDK package
**
** Commercial License Usage
**
** Licensees holding valid commercial NECTO compilers AI licenses may use this
** file in accordance with the commercial license agreement provided with the
** Software or, alternatively, in accordance with the terms contained in
** a written agreement between you and The MikroElektronika Company.
** For licensing terms and conditions see
** https://www.mikroe.com/legal/software-license-agreement.
** For further information use the contact form at
** https://www.mikroe.com/contact.
**
**
** GNU Lesser General Public License Usage
**
** Alternatively, this file may be used for
** non-commercial projects under the terms of the GNU Lesser
** General Public License version 3 as published by the Free Software
** Foundation: https://www.gnu.org/licenses/lgpl-3.0.html.
**
** The above copyright notice and this permission notice shall be
** included in all copies or substantial portions of the Software.
**
** THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
** OF MERCHANTABILITY, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED
** TO THE WARRANTIES FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
** IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM,
** DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT
** OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE
** OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
**
****************************************************************************/

#ifndef __MK26FN2M0VLQ18_H__
#define __MK26FN2M0VLQ18_H__



//*****************************************************************************
//
// Interrupt assignments
//
//*****************************************************************************

#define NUMBER_OF_INT_VECTORS                   114              // Number of interrupts in the Vector table
#define NotAvail_IRQn                           -100             // Not available device specific interrupt
#define NonMaskableInterrupt_IRQn               -14              // Non-maskable Interrupt (NMI)
#define HardFault_IRQn                          -13              // Hard Fault
#define MemManageFault_IRQn                     -12              // MemManage Fault
#define BusFault_IRQn                           -11              // Bus Fault
#define UsageFault_IRQn                         -10              // Usage Fault
#define SVCall_IRQn                             -5               // Supervisor call (SVCall)
#define DebugMonitor_IRQn                       -4               // Debug Monitor
#define PendSV_IRQn                             -2               // Pendable request for system service (PendableSrvReq)
#define SysTick_IRQn                            -1               // System tick timer (SysTick)
#define DMA0_IRQn                               0                // DMA channel 0, 16 transfer complete
#define DMA1_IRQn                               1                // DMA channel 1, 17 transfer complete
#define DMA2_IRQn                               2                // DMA channel 2, 18 transfer complete
#define DMA3_IRQn                               3                // DMA channel 3, 19 transfer complete
#define DMA4_IRQn                               4                // DMA channel 4, 20 transfer complete
#define DMA5_IRQn                               5                // DMA channel 5, 21 transfer complete
#define DMA6_IRQn                               6                // DMA channel 6, 22 transfer complete
#define DMA7_IRQn                               7                // DMA channel 7, 23 transfer complete
#define DMA8_IRQn                               8                // DMA channel 8, 24 transfer complete
#define DMA9_IRQn                               9                // DMA channel 9, 25 transfer complete
#define DMA10_IRQn                              10               // DMA channel 10, 26 transfer complete
#define DMA11_IRQn                              11               // DMA channel 11, 27 transfer complete
#define DMA12_IRQn                              12               // DMA channel 12, 28 transfer complete
#define DMA13_IRQn                              13               // DMA channel 13, 29 transfer complete
#define DMA14_IRQn                              14               // DMA channel 14, 30 transfer complete
#define DMA15_IRQn                              15               // DMA channel 15, 31 transfer complete
#define DMA_Error_IRQn                          16               // DMA error interrupt channels 0-31
#define MCM_Interrupt_IRQn                      17               // MCM interrupt
#define Command_Complete_IRQn                   18               // Command complete
#define Read_Collision_IRQn                     19               // Read collision
#define PMC_IRQn                                20               // Low-voltage detect, low-voltage warning
#define LLWU_IRQn                               21               // Low Leakage Wakeup
#define Both_Watchdog_Modules_Share_This_Interrupt_IRQn 22               // Both watchdog modules share this interrupt
#define Randon_Number_Generator_IRQn            23               // Randon Number Generator
#define I2C0_IRQn                               24               // -
#define I2C1_IRQn                               25               // -
#define SPI0_IRQn                               26               // Single interrupt vector for all sources
#define SPI1_IRQn                               27               // Single interrupt vector for all sources
#define Transmit_IRQn                           28               // Transmit
#define Receive_IRQn                            29               // Receive
#define UART0_RX_TX_IRQn                        31               // Single interrupt vector for UART status sources
#define UART0_ERR_IRQn                          32               // Single interrupt vector for UART error sources
#define UART1_RX_TX_IRQn                        33               // Single interrupt vector for UART status sources
#define UART1_ERR_IRQn                          34               // Single interrupt vector for UART error sources
#define UART2_RX_TX_IRQn                        35               // Single interrupt vector for UART status sources
#define UART2_ERR_IRQn                          36               // Single interrupt vector for UART error sources
#define UART3_RX_TX_IRQn                        37               // Single interrupt vector for UART status sources
#define UART3_ERR_IRQn                          38               // Single interrupt vector for UART error sources
#define ADC0_IRQn                               39               // -
#define CMP0_IRQn                               40               // -
#define CMP1_IRQn                               41               // -
#define FTM0_IRQn                               42               // Single interrupt vector for all sources
#define FTM1_IRQn                               43               // Single interrupt vector for all sources
#define FTM2_IRQn                               44               // Single interrupt vector for all sources
#define CMT_IRQn                                45               // -
#define Alarm_Interrupt_IRQn                    46               // Alarm interrupt
#define Seconds_Interrupt_IRQn                  47               // Seconds interrupt
#define PIT0_IRQn                               48               // Channel 0
#define PIT1_IRQn                               49               // Channel 1
#define PIT2_IRQn                               50               // Channel 2
#define PIT3_IRQn                               51               // Channel 3
#define PDB_IRQn                                52               // -
#define USBFS_OTG_IRQn                          53               // -
#define USBFS_Charger_Detect_IRQn               54               // -
#define DAC0_IRQn                               56               // -
#define MCG_IRQn                                57               // -
#define LPTMR0_IRQn                             58               // -
#define PORTA_IRQn                              59               // Pin detect (Port A)
#define PORTB_IRQn                              60               // Pin detect (Port B)
#define PORTC_IRQn                              61               // Pin detect (Port C)
#define PORTD_IRQn                              62               // Pin detect (Port D)
#define PORTE_IRQn                              63               // Pin detect (Port E)
#define Software_Interrupt_IRQn                 64               // Software interrupt
#define SPI2_IRQn                               65               // Single interrupt vector for all sources
#define UART4_RX_TX_IRQn                        66               // Single interrupt vector for UART status sources
#define UART4_ERR_IRQn                          67               // Single interrupt vector for UART error sources
#define CMP2_IRQn                               70               // -
#define FTM3_IRQn                               71               // Single interrupt vector for all sources
#define DAC1_IRQn                               72               // -
#define ADC1_IRQn                               73               // -
#define I2C2_IRQn                               74               // -
#define CAN0_0Red_Message_buffer_IRQn           75               // OR'ed Message buffer (0-15)
#define CAN0_Bus_Off_IRQn                       76               // Bus Off
#define CAN0_Error_IRQn                         77               // Error
#define CAN0_Tx_Warning_IRQn                    78               // Transmit Warning
#define CAN0_Rx_Warning_IRQn                    79               // Receive Warning
#define CAN0_Wake_Up_IRQn                       80               // Wake Up
#define SDHC_IRQn                               81               // -
#define Status_And_Error_IRQn                   86               // Status and error
#define TSI0_IRQn                               87               // -
#define TPM1_IRQn                               88               // -
#define TPM2_IRQn                               89               // -
#define Both_USBHS_DCD_And_USBHS_Phy_Modules_Share_This_Interrupt_IRQn 90               // Both USBHS DCD and USBHS Phy modules share this interrupt
#define I2C3_IRQn                               91               // -
#define CMP3_IRQn                               92               // -
#define USBHS_OTG_IRQn                          93               // -
#define CAN1_0Red_Message_buffer_IRQn           94               // OR'ed Message buffer (0-15)
#define CAN1_Bus_Off_IRQn                       95               // Bus Off
#define CAN1_Error_IRQn                         96               // Error
#define CAN1_Tx_Warning_IRQn                    97               // Transmit Warning
#define CAN1_Rx_Warning_IRQn                    98               // Receive Warning
#define CAN1_Wake_Up_IRQn                       99               // Wake Up



//*****************************************************************************
//
// Port Control and Interrupts (PORT) registers
//
//*****************************************************************************

