MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK26FN2M0VLQ18/mcu.h
#define IS                            0x00000800      // Initiate self-refresh command.
#define RTIM                          0x00000C00      // Refresh timing
#define RC                            0x0001FF00      // Refresh count


//*****************************************************************************
//
// The following are defines for the bit fields in the SDRAM_ACn register.
//
//*****************************************************************************

#define BA                            0x1FFF80000000      // Base address register.
#define RE                            0x00008000      // Refresh enable
#define CASL                          0x00006000      // CAS Latency
#define CBM                           0x00001C00      // Command bit location
#define IMRS                          0x00000040      // Initiate mode register set (mrs) command.
#define PS                            0x00000060      // Port size.
#define IP                            0x00000008      // Initiate precharge all (pall) command.


//*****************************************************************************
//
// The following are defines for the bit fields in the SDRAM_CMn register.
//
//*****************************************************************************

#define BAM                           0x1FFF80000000      // Base address mask.
#define WP                            0x00000100      // Write protect.
#define V                             0x00000001      // Valid.


//*****************************************************************************
//
// The following are defines for the bit fields in the CRC_DATA register.
//
//*****************************************************************************

#define HU                            0x7F80000000      // CRC High Upper Byte
#define HL                            0x7F800000      // CRC High Lower Byte
#define LU                            0x007F8000      // CRC Low Upper Byte
#define LL                            0x00007F80      // CRC Low Lower Byte


//*****************************************************************************
//
// The following are defines for the bit fields in the CRC_GPOLY register.
//
//*****************************************************************************

#define HIGH                          0x7FFF80000000      // High Polynominal Half-word
#define LOW                           0x7FFF8000      // Low Polynominal Half-word


//*****************************************************************************
//
// The following are defines for the bit fields in the CRC_CTRL register.
//
//*****************************************************************************

#define TOT                           0x04000000      // -
#define TOTR                          0x02000000      // -
#define FXOR                          0x01000000      // -
#define WAS                           0x00800000      // -
#define TCRC                          0x00400000      // -


//*****************************************************************************
//
// The following are defines for the bit fields in the CAU_CASR register.
//
//*****************************************************************************

#define CAU Version                   0x780000000      // VER
#define DES Parity Error              0x00000002      // DPE
#define Illegal Command               0x00000001      // IC


//*****************************************************************************
//
// The following are defines for the bit fields in the CAU_CAA register.
//
//*****************************************************************************

#define ACC                           0x7FFFFFFF80000000      // Accumulator


//*****************************************************************************
//
// The following are defines for the bit fields in the CAU_CAn register.
//
//*****************************************************************************

#define CAn                           0x7FFFFFFF80000000      // General Purpose Registers


//*****************************************************************************
//
// The following are defines for the bit fields in the RNG_SR register.
//
//*****************************************************************************

#define OREG_SIZE                     0x7F800000      // Output Register Size
#define OREG_LVL                      0x007F8000      // Output Register Level
#define SLP                           0x00000010      // Sleep
#define ERRI                          0x00000008      // Error Interrupt
#define ORU                           0x00000004      // Output Register Underflow
#define LRS                           0x00000002      // Last Read Status
#define SECV                          0x00000001      // Security Violation


//*****************************************************************************
//
// The following are defines for the bit fields in the RNG_ER register.
//
//*****************************************************************************

#define EXT_ENT                       0x7FFFFFFF80000000      // External Entropy


//*****************************************************************************
//
// The following are defines for the bit fields in the RNG_OR register.
//
//*****************************************************************************

#define RANDOUT                       0x7FFFFFFF80000000      // Random Output


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCx_SC1n register.
//
//*****************************************************************************

#define COCO                          0x00000080      // Conversion Complete Flag
#define AIEN                          0x00000040      // Interrupt Enable
#define DIFF                          0x00000020      // Differential Mode Enable
#define ADCH                          0x000001F0      // Input channel select


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCx_CFG1 register.
//
//*****************************************************************************

#define ADLPC                         0x00000080      // Low-Power Configuration
#define ADIV                          0x000000C0      // Clock Divide Select
#define ADLSMP                        0x00000010      // Sample Time Configuration
#define MODE                          0x00000018      // Conversion mode selection
#define ADICLK                        0x00000006      // Input Clock Select


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCx_CFG2 register.
//
//*****************************************************************************

#define MUXSEL                        0x00000010      // ADC Mux Select
#define ADACKEN                       0x00000008      // Asynchronous Clock Output Enable
#define ADHSC                         0x00000004      // High-Speed Configuration
#define ADLSTS                        0x00000006      // Long Sample Time Select


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCx_Rn register.
//
//*****************************************************************************

#define D                             0x7FFF8000      // Data result ::


//*****************************************************************************
//
// The following are defines for the bit fields in the ADCx_CVn register.
//
//*****************************************************************************

