MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK26FN2M0VLQ18/mcu.h
#define EOCF                          0x00000080      // End Of Cycle Status Flag
#define CMTDIV                        0x000000C0      // CMT Clock Divide Prescaler
#define EXSPC                         0x00000010      // Extended Space Enable
#define BASE                          0x00000008      // Baseband Enable
#define FSK                           0x00000004      // FSK Mode Select
#define EOCIE                         0x00000002      // End of Cycle Interrupt Enable
#define MCGEN                         0x00000001      // Modulator and Carrier Generator Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the CMT_CMD1 register.
//
//*****************************************************************************

#define MB[7:0]                       0x00007F80      // MB[7:0]


//*****************************************************************************
//
// The following are defines for the bit fields in the CMT_CMD2 register.
//
//*****************************************************************************

#define MB[15:8]                      0x00007F80      // MB[15:8]


//*****************************************************************************
//
// The following are defines for the bit fields in the CMT_CMD3 register.
//
//*****************************************************************************

#define SB[7:0]                       0x00007F80      // SB[7:0]


//*****************************************************************************
//
// The following are defines for the bit fields in the CMT_CMD4 register.
//
//*****************************************************************************

#define SB[15:8]                      0x00007F80      // SB[15:8]


//*****************************************************************************
//
// The following are defines for the bit fields in the CMT_PPS register.
//
//*****************************************************************************

#define PPSDIV                        0x00000078      // Primary Prescaler Divider


//*****************************************************************************
//
// The following are defines for the bit fields in the CMT_DMA register.
//
//*****************************************************************************

#define DMA                           0x00000001      // DMA Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_PERID register.
//
//*****************************************************************************

#define ID                            0x00000078      // Peripheral Identification


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_IDCOMP register.
//
//*****************************************************************************

#define NID                           0x00000780      // Ones' complement of PERID[ID]. bits


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_REV register.
//
//*****************************************************************************

#define REV                           0x00007F80      // Revision


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_ADDINFO register.
//
//*****************************************************************************

#define IEHOST                        0x00000001      // This bit is set if host mode is enabled


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_OTGISTAT register.
//
//*****************************************************************************

#define IDCHG                         0x00000080      // This bit is set when a change in the ID Signal from the USB connector is sensed
#define ONEMSEC                       0x00000040      // This bit is set when the 1 millisecond timer expires
#define LINE_STATE_CHG                0x00000020      // This interrupt is set when the USB line state (CTL[SE0] and CTL[JSTATE] bits) are stable without change for 1 millisecond, and the value of the line state is different from the last time when the line state was stable
#define SESSVLDCHG                    0x00000008      // This bit is set when a change in VBUS is detected indicating a session valid or a session no longer valid
#define B_SESS_CHG                    0x00000004      // This bit is set when a change in VBUS is detected on a B device
#define AVBUSCHG                      0x00000001      // This bit is set when a change in VBUS is detected on an A device


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_OTGICR register.
//
//*****************************************************************************

#define IDEN                          0x00000080      // ID Interrupt Enable
#define ONEMSECEN                     0x00000040      // One Millisecond Interrupt Enable
#define LINESTATEEN                   0x00000020      // Line State Change Interrupt Enable
#define SESSVLDEN                     0x00000008      // Session Valid Interrupt Enable
#define BSESSEN                       0x00000004      // B Session END Interrupt Enable
#define AVBUSEN                       0x00000001      // A VBUS Valid Interrupt Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_OTGSTAT register.
//
//*****************************************************************************

#define ID                            0x00000080      // Indicates the current state of the ID pin on the USB connector
#define ONEMSECEN                     0x00000040      // This bit is reserved for the 1ms count, but it is not useful to software
#define LINESTATESTABLE               0x00000020      // Indicates that the internal signals that control the LINE_STATE_CHG field of OTGISTAT are stable for at least 1 ms
#define SESS_VLD                      0x00000008      // Session Valid
#define BSESSEND                      0x00000004      // B Session End
#define AVBUSVLD                      0x00000001      // A VBUS Valid


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_OTGCTL register.
//
//*****************************************************************************

#define DPHIGH                        0x00000080      // D+ Data Line pullup resistor enable
#define DPLOW                         0x00000020      // D+ Data Line pull-down resistor enable
#define DMLOW                         0x00000010      // D– Data Line pull-down resistor enable
#define OTGEN                         0x00000004      // On-The-Go pullup/pulldown resistor enable


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_ISTAT register.
//
//*****************************************************************************

#define STALL                         0x00000080      // Stall Interrupt
#define ATTACH                        0x00000040      // Attach Interrupt
#define RESUME                        0x00000020      // This bit is set when a K-state is observed on the DP/DM signals for 2.5 µs
#define SLEEP                         0x00000010      // This bit is set when the USB Module detects a constant idle on the USB bus for 3 ms
#define TOKDNE                        0x00000008      // This bit is set when the current token being processed has completed
#define SOFTOK                        0x00000004      // This bit is set when the USB Module receives a Start Of Frame (SOF) token
#define ERROR                         0x00000002      // This bit is set when any of the error conditions within Error Interrupt Status (ERRSTAT) register occur
#define USBRST                        0x00000001      // This bit is set when the USB Module has decoded a valid USB reset


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_INTEN register.
//
//*****************************************************************************

#define STALLEN                       0x00000080      // STALL Interrupt Enable
#define ATTACHEN                      0x00000040      // ATTACH Interrupt Enable
#define RESUMEEN                      0x00000020      // RESUME Interrupt Enable
#define SLEEPEN                       0x00000010      // SLEEP Interrupt Enable
#define TOKDNEEN                      0x00000008      // TOKDNE Interrupt Enable
#define SOFTOKEN                      0x00000004      // SOFTOK Interrupt Enable
#define ERROREN                       0x00000002      // ERROR Interrupt Enable
#define USBRSTEN                      0x00000001      // USBRST Interrupt Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_ERRSTAT register.
//
//*****************************************************************************

#define BTSERR                        0x00000080      // This bit is set when a bit stuff error is detected
#define DMAERR                        0x00000020      // This bit is set if the USB Module has requested a DMA access to read a new BDT but has not been given the bus before it needs to receive or transmit data
#define BTOERR                        0x00000010      // This bit is set when a bus turnaround timeout error occurs
#define DFN8                          0x00000008      // This bit is set if the data field received was not 8 bits in length
#define CRC16                         0x00000004      // This bit is set when a data packet is rejected due to a CRC16 error
#define CRC5EOF                       0x00000002      // This error interrupt has two functions
#define PIDERR                        0x00000001      // This bit is set when the PID check field fails


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_ERREN register.
//
//*****************************************************************************

#define BTSERREN                      0x00000080      // BTSERR Interrupt Enable
#define DMAERREN                      0x00000020      // DMAERR Interrupt Enable
#define BTOERREN                      0x00000010      // BTOERR Interrupt Enable
#define DFN8EN                        0x00000008      // DFN8 Interrupt Enable
#define CRC16EN                       0x00000004      // CRC16 Interrupt Enable
#define CRC5EOFEN                     0x00000002      // CRC5/EOF Interrupt Enable
#define PIDERREN                      0x00000001      // PIDERR Interrupt Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_STAT register.
//
//*****************************************************************************

#define ENDP                          0x00000780      // This four-bit field encodes the endpoint address that received or transmitted the previous token
#define TX                            0x00000008      // Transmit Indicator
#define ODD                           0x00000004      // This bit is set if the last buffer descriptor updated was in the odd bank of the BDT


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_CTL register.
//
//*****************************************************************************

