MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK26FN2M0VLQ18/mcu.h
#define USBPHY_TX_EDGECTRL            0x70000000      // Controls the edge-rate of the current sensing transistors used in HS transmit
#define TXCAL45DP                     0x00780000      // Decode to trim the nominal 45Ω series termination resistance to the USB_DP output pin
#define TXCAL45DM                     0x00007800      // Decode to trim the nominal 45Ω series termination resistance to the USB_DM output pin
#define D_CAL                         0x00000780      // Decode to trim the nominal 17.78mA current source for the High Speed TX drivers on USB_DP and USB_DM


//*****************************************************************************
//
// The following are defines for the bit fields in the USBPHY_RXn register.
//
//*****************************************************************************

#define RXDBYPASS                     0x00400000      // Use the output of the USB_DP single-ended receiver in place of the full-speed differential receiver
#define DISCONADJ                     0x000001C0      // The DISCONADJ field adjusts the trip point for the disconnect detector
#define ENVADJ                        0x00000008      // The ENVADJ field adjusts the trip point for the envelope detector


//*****************************************************************************
//
// The following are defines for the bit fields in the USBPHY_CTRLn register.
//
//*****************************************************************************

#define SFTRST                        0x80000000      // Soft-reset the USBPHY_PWD, USBPHY_TX, USBPHY_RX, and USBPHY_CTRL registers
#define CLKGATE                       0x40000000      // Gate UTMI Clocks
#define UTMI_SUSPENDM                 0x20000000      // Powered-down state
#define HOST_FORCE_LS_SE0             0x10000000      // Forces the next FS packet that is transmitted to have a EOP with low-speed timing
#define OTG_ID_VALUE                  0x08000000      // Indicates the results of USB_ID pin while monitoring the cable plugged into the Micro- or Mini-AB receptacle
#define FSDLL_RST_EN                  0x01000000      // Enables the feature to reset the FSDLL lock detection logic at the end of each TX packet
#define ENAUTOCLR_PHY_PWD             0x00100000      // Enables the feature to auto-clear the PWD register bits in USBPHY_PWD if there is wakeup event while USB is suspended
#define ENAUTOCLR_CLKGATE             0x00080000      // Enables the feature to auto-clear the CLKGATE bit if there is wakeup event while USB is suspended
#define AUTORESUME_EN                 0x00040000      // Enable the auto resume feature
#define ENUTMILEVEL3                  0x00008000      // Enables UTMI+ Level 3 operation for the USB HS PHY
#define ENUTMILEVEL2                  0x00004000      // Enables UTMI+ Level 2 operation for the USB HS PHY
#define DEVPLUGIN_IRQ                 0x00001000      // Indicates that the device is connected
#define ENDEVPLUGINDET                0x00000010      // Enables non-standard resistive plugged-in detection
#define HOSTDISCONDETECT_IRQ          0x00000008      // Indicates that the device has disconnected in High-Speed mode
#define ENHOSTDISCONDETECT            0x00000002      // Enables high-speed disconnect detector


//*****************************************************************************
//
// The following are defines for the bit fields in the USBPHY_STATUS register.
//
//*****************************************************************************

#define RESUME_STATUS                 0x00000400      // Indicates that the host is sending a wake-up after Suspend and has triggered an interrupt
#define OTGID_STATUS                  0x00000100      // Indicates the results of USB_ID pin on the USB cable plugged into the local Micro- or Mini-AB receptacle
#define DEVPLUGIN_STATUS              0x00000040      // Status indicator for non-standard resistive plugged-in detection
#define HOSTDISCONDETECT_STATUS       0x00000008      // Indicates at the local host (downstream) port that the remote device has disconnected while in High-Speed mode


//*****************************************************************************
//
// The following are defines for the bit fields in the USBPHY_DEBUGn register.
//
//*****************************************************************************

#define CLKGATE                       0x40000000      // Gate Test Clocks
#define HOST_RESUME_DEBUG             0x20000000      // Choose to trigger the host resume SE0 with HOST_FORCE_LS_SE0 = 0 or UTMI_SUSPEND = 1
#define SQUELCHRESETLENGTH            0xF0000000      // Duration of RESET in terms of the number of 480-MHz cycles
#define ENSQUELCHRESET                0x01000000      // Set bit to allow squelch to reset high-speed receive
#define SQUELCHRESETCOUNT             0x01F00000      // Delay in between the detection of squelch to the reset of high-speed RX
#define ENTX2RXCOUNT                  0x00001000      // Set this bit to allow a countdown to transition in between TX and RX
#define TX2RXCOUNT                    0x00007800      // Delay in between the end of transmit to the beginning of receive
#define ENHSTPULLDOWN                 0x00000060      // This bit field selects host pulldown overdrive mode
#define HSTPULLDOWN                   0x00000018      // This bit field selects whether to connect pulldown resistors on the USB_DP/USB_DM pins if the corresponding pulldown overdrive mode is enabled through USBPHY_DEBUG[5:4]
#define DEBUG_INTERFACE_HOLD          0x00000002      // Use holding registers to assist in timing for external UTMI interface
#define OTGIDPIOLOCK                  0x00000001      // Once OTG ID from USBPHY_STATUS_OTGID_STATUS is sampled, use this to hold the value


//*****************************************************************************
//
// The following are defines for the bit fields in the USBPHY_DEBUG0_STATUS register.
//
//*****************************************************************************

#define SQUELCH_COUNT                 0x1F80000000      // Running count of the squelch reset instead of normal end for HS RX
#define UTMI_RXERROR_FAIL_COUNT       0x7FE000000      // Running count of the UTMI_RXERROR
#define LOOP_BACK_FAIL_COUNT          0x7FFF8000      // Running count of the failed pseudo-random generator loopback


//*****************************************************************************
//
// The following are defines for the bit fields in the USBPHY_DEBUG1n register.
//
//*****************************************************************************

#define ENTAILADJVD                   0x0000C000      // Delay increment of the rise of squelch


//*****************************************************************************
//
// The following are defines for the bit fields in the USBPHY_VERSION register.
//
//*****************************************************************************

#define MAJOR                         0x7F80000000      // Fixed read-only value reflecting the MAJOR field of the RTL version
#define MINOR                         0x7F800000      // Fixed read-only value reflecting the MINOR field of the RTL version
#define STEP                          0x7FFF8000      // Fixed read-only value reflecting the stepping of the RTL version


//*****************************************************************************
//
// The following are defines for the bit fields in the USBPHY_PLL_SICn register.
//
//*****************************************************************************

